XMLReaderCA/src/jbiasa/XMLReaderCA.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="XMLReaderCA"
             xmlns:tns="XMLReaderCA" xmlns:ns="http://j2ee.netbeans.org/wsdl/XMLReader/src/XmlReader" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://j2ee.netbeans.org/wsdl/XMLReader/src/XmlReader" location="../jbiServiceUnits/XMLReader/XMLReader.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:XmlReaderPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="XmlReaderOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="XMLReaderCA"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="XMLReaderCA"/>
            </output>
        </operation>
    </binding>
    <service name="XMLReaderCAService1">
        <port name="casaPort1" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/XMLReaderCAService1/casaPort1"/>
        </port>
    </service>
</definitions>
