XMLReaderCA/test/XMLReaderCATest/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xr="XMLReaderCA">
  <soapenv:Body>
    <xr:XmlReaderOperation>
      <part1>http://schemas.xmlsoap.org/wsdl/</part1>
    </xr:XmlReaderOperation>
  </soapenv:Body>
</soapenv:Envelope>